In [9]:
import pandas as pd

df1 = pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
df2 = pd.DataFrame({'a':[11,12,13],'b':[14,15,16]})
df1, df2

(   a  b
 0  1  4
 1  2  5
 2  3  6,     a   b
 0  11  14
 1  12  15
 2  13  16)

In [10]:
pd.concat([df1, df2], axis=0)

    a   b
0   1   4
1   2   5
2   3   6
0  11  14
1  12  15
2  13  16

In [11]:
pd.concat([df1, df2], axis=1)

   a  b   a   b
0  1  4  11  14
1  2  5  12  15
2  3  6  13  16

In [13]:
df1.drop('a', axis=1)   # 0对列进行操作，1对行进行操作，删除'a'列的所有行

   b
0  4
1  5
2  6

In [14]:
df1.sum(axis=0)   # 对列进行求和

a     6
b    15
dtype: int64

# inplace

In [ ]:
drop_duplicates(inplace=True)是直接对原dataFrame进行操作。
drop_duplicates(inplace=False)将不改变原来的dataFrame，而将结果生成在一个新的dataFrame中。

In [16]:
df1.drop('a', axis=1)

   b
0  4
1  5
2  6

In [17]:
df1

   a  b
0  1  4
1  2  5
2  3  6

In [18]:
df1.drop('a', axis=1, inplace=True)

In [19]:
df1

   b
0  4
1  5
2  6